n=int(input('Введите номер месяца '))
"""Попросим пользователя ввести номер месяца. Это будет переменная n."""
y=('январь','февраль','март','апрель','май','июнь','июль','август','сентябрь','октябрь','ноябрь','декабрь')
"""Создаём кортеж с месяцами"""
if n<=12:
    for i in range(n):
        print(y[i])
else:
    print('Ошибка при вводе!')
"""Если пользователь ввёл верное число, то выполняется цикл for, который выводит на экран все n количество месяцев. В противном
случае на экран с помощью оператора print сообщаем пользователю об ошибке"""